#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.google_client_config.default: Reading...
data.google_client_config.default: Read complete after 0s [id=projects/"exemplary-tide-379122"/regions/"us-east1"/zones/<null>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_container_cluster.flyte_cluster will be created
  + resource "google_container_cluster" "flyte_cluster" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 2
      + label_fingerprint           = (known after apply)
      + location                    = "us-east1-b"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "flyte-cluster"
      + network                     = "default"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = (known after apply)
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + node_config {
          + disk_size_gb      = 10
          + disk_type         = "pd-balanced"
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false
          + taint             = (known after apply)

          + ephemeral_storage_local_ssd_config {
              + local_ssd_count = 0
            }
        }

      + release_channel {
          + channel = "REGULAR"
        }
    }

  # google_container_node_pool.flyte_node_pool will be created
  + resource "google_container_node_pool" "flyte_node_pool" {
      + cluster                     = "flyte-cluster"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-east1-b"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "flyte-np"
      + name_prefix                 = (known after apply)
      + node_count                  = 2
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 4
          + min_node_count  = 2
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "e2-medium"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = (known after apply)
          + spot              = false
          + taint             = (known after apply)
        }
    }

  # google_project_iam_binding.flyte_backend_role_binding will be created
  + resource "google_project_iam_binding" "flyte_backend_role_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = (sensitive value)
      + role    = (known after apply)
    }

  # google_project_iam_custom_role.flyte_backend_role will be created
  + resource "google_project_iam_custom_role" "flyte_backend_role" {
      + deleted     = (known after apply)
      + description = "Custom IAM role for the Flyte backend service"
      + id          = (known after apply)
      + name        = (known after apply)
      + permissions = [
          + "cloudsql.databases.create",
          + "cloudsql.databases.delete",
          + "cloudsql.databases.get",
          + "cloudsql.databases.update",
          + "container.clusters.getCredentials",
          + "container.pods.create",
          + "container.pods.get",
          + "container.pods.list",
          + "storage.objects.create",
          + "storage.objects.delete",
          + "storage.objects.get",
          + "storage.objects.list",
          + "storage.objects.update",
        ]
      + project     = (known after apply)
      + role_id     = "flyteBackendRole"
      + stage       = "GA"
      + title       = "Flyte Backend Role"
    }

  # google_project_iam_member.user_code_role_member will be created
  + resource "google_project_iam_member" "user_code_role_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (sensitive value)
      + role    = "roles/editor"
    }

  # google_project_service.cloud_sql_api will be created
  + resource "google_project_service" "cloud_sql_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (sensitive value)
      + service            = "sqladmin.googleapis.com"
    }

  # google_project_service.composer_api will be created
  + resource "google_project_service" "composer_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (sensitive value)
      + service            = "composer.googleapis.com"
    }

  # google_project_service.compute_api will be created
  + resource "google_project_service" "compute_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (sensitive value)
      + service            = "compute.googleapis.com"
    }

  # google_project_service.container_api will be created
  + resource "google_project_service" "container_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (sensitive value)
      + service            = "container.googleapis.com"
    }

  # google_project_service.secret_mgr_api will be created
  + resource "google_project_service" "secret_mgr_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (sensitive value)
      + service            = "secretmanager.googleapis.com"
    }

  # google_service_account.flyte_service_account will be created
  + resource "google_service_account" "flyte_service_account" {
      + account_id   = "flyte-sa"
      + disabled     = false
      + display_name = "Flyte Orchestrator Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account.user_code_service_account will be created
  + resource "google_service_account" "user_code_service_account" {
      + account_id   = "user-code-sa"
      + disabled     = false
      + display_name = "User Code Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_sql_database_instance.flyte_db_backend will be created
  + resource "google_sql_database_instance" "flyte_db_backend" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_14"
      + deletion_protection            = true
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "flyte-db-backend"
      + private_ip_address             = (known after apply)
      + project                        = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "us-east1"
      + self_link                      = (known after apply)
      + server_ca_cert                 = (known after apply)
      + service_account_email_address  = (known after apply)

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = 10
          + disk_type             = "PD_HDD"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)
        }
    }

  # google_sql_user.flyte_db_user will be created
  + resource "google_sql_user" "flyte_db_user" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "flyte-db-backend"
      + name                    = "postgres"
      + password                = (sensitive value)
      + project                 = (known after apply)
      + sql_server_user_details = (known after apply)
    }

  # helm_release.flyte_single_cluster will be created
  + resource "helm_release" "flyte_single_cluster" {
      + atomic                     = false
      + chart                      = "flyte-binary"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "flyte-test-setup"
      + namespace                  = "flyte"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.flyte.org"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.8.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # random_password.flyte_db_password will be created
  + resource "random_password" "flyte_db_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_@#"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.flyte_gcs_backend.google_storage_bucket.buckets["flyte-storage-backend"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "name"              = "pricing-aggregator-us-east1-flyte-storage-backend"
          + "project_name"      = "pricing-aggregator"
          + "project_workspace" = (sensitive value)
        }
      + location                    = "US-EAST1"
      + name                        = "pricing-aggregator-us-east1-flyte-storage-backend"
      + project                     = (sensitive value)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = false
        }
    }

  # module.flyte_gcs_backend.google_storage_bucket_iam_binding.admins["flyte-storage-backend"] will be created
  + resource "google_storage_bucket_iam_binding" "admins" {
      + bucket = "pricing-aggregator-us-east1-flyte-storage-backend"
      + etag   = (known after apply)
      + id     = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

  # module.flyte_gcs_backend.random_id.bucket_suffix will be created
  + resource "random_id" "bucket_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.gcs_api_extract.google_storage_bucket.buckets["spotify-web-api-extracts"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "name"              = "pricing-aggregator-us-east1-spotify-web-api-extracts"
          + "project_name"      = "pricing-aggregator"
          + "project_workspace" = (sensitive value)
        }
      + location                    = "US-EAST1"
      + name                        = "pricing-aggregator-us-east1-spotify-web-api-extracts"
      + project                     = (sensitive value)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = false
        }
    }

  # module.gcs_api_extract.google_storage_bucket_iam_binding.admins["spotify-web-api-extracts"] will be created
  + resource "google_storage_bucket_iam_binding" "admins" {
      + bucket = "pricing-aggregator-us-east1-spotify-web-api-extracts"
      + etag   = (known after apply)
      + id     = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

  # module.gcs_api_extract.random_id.bucket_suffix will be created
  + resource "random_id" "bucket_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 22 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kevinsunny1996, Action: `pull_request`*